trade/src/Catalogs/УчетныеЗаписиОблачногоЭДО/УчетныеЗаписиОблачногоЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиОблачногоЭДО</name>
  <attributes>
    <name>АдресСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешАдресаСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

trade/src/InformationRegisters/НастройкиОблачногоЭДО/НастройкиОблачногоЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОблачногоЭДО</name>
  <resources>
    <name>УчетнаяЗаписьОблачногоЭДО</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиОблачногоЭДО</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Catalogs/УчетныеЗаписиОблачногоЭДО/ObjectModule.bsl
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ХешАдресаСервиса = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(АдресСервиса);
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиОблачногоЭДО.НайтиПоАдресуСервиса(АдресСервиса);
	Если ЗначениеЗаполнено(УчетнаяЗапись)
		И УчетнаяЗапись <> Ссылка Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Учетная запись облачного ЭДО с адресом сервиса ""%1"" уже существует'"),
			АдресСервиса);
		ОбщегоНазначенияБЭД.ЗаписатьВЖурналРегистрации(ТекстСообщения,
			ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторыЭДО = РегистрыСведений.НастройкиОблачногоЭДО.ИдентификаторыЭДОУчетнойЗаписи(Ссылка);
	Если Не ЗначениеЗаполнено(ИдентификаторыЭДО) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ИдентификаторЭДО Из ИдентификаторыЭДО Цикл
		УчетныеЗаписиЭДО.УдалитьУчетнуюЗапись(ИдентификаторЭДО);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
